app/controllers/students_controller.rb

    def index
        @students = Student.all
---
SELECT "students".* FROM "students"

    def show
        @student= Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def create
        @student = Student.new(student_params)
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Naty"], ["last_name", "Rabin\r\n"], ["created_at", "2020-08-06 03:19:55.662386"], ["updated_at", "2020-08-06 03:19:55.662386"]]